MikroElektronika/core_packages/PIC/XC8/def/PIC12F629/mcu.h
extern volatile IOCbits_t IOCbits __at(0x096);
// bitfield macros
#define _IOC_IOC0_POSN                                      0x0
#define _IOC_IOC0_POSITION                                  0x0
#define _IOC_IOC0_SIZE                                      0x1
#define _IOC_IOC0_LENGTH                                    0x1
#define _IOC_IOC0_MASK                                      0x1
#define _IOC_IOC1_POSN                                      0x1
#define _IOC_IOC1_POSITION                                  0x1
#define _IOC_IOC1_SIZE                                      0x1
#define _IOC_IOC1_LENGTH                                    0x1
#define _IOC_IOC1_MASK                                      0x2
#define _IOC_IOC2_POSN                                      0x2
#define _IOC_IOC2_POSITION                                  0x2
#define _IOC_IOC2_SIZE                                      0x1
#define _IOC_IOC2_LENGTH                                    0x1
#define _IOC_IOC2_MASK                                      0x4
#define _IOC_IOC3_POSN                                      0x3
#define _IOC_IOC3_POSITION                                  0x3
#define _IOC_IOC3_SIZE                                      0x1
#define _IOC_IOC3_LENGTH                                    0x1
#define _IOC_IOC3_MASK                                      0x8
#define _IOC_IOC4_POSN                                      0x4
#define _IOC_IOC4_POSITION                                  0x4
#define _IOC_IOC4_SIZE                                      0x1
#define _IOC_IOC4_LENGTH                                    0x1
#define _IOC_IOC4_MASK                                      0x10
#define _IOC_IOC5_POSN                                      0x5
#define _IOC_IOC5_POSITION                                  0x5
#define _IOC_IOC5_SIZE                                      0x1
#define _IOC_IOC5_LENGTH                                    0x1
#define _IOC_IOC5_MASK                                      0x20
#define _IOC_IOCB0_POSN                                     0x0
#define _IOC_IOCB0_POSITION                                 0x0
#define _IOC_IOCB0_SIZE                                     0x1
#define _IOC_IOCB0_LENGTH                                   0x1
#define _IOC_IOCB0_MASK                                     0x1
#define _IOC_IOCB1_POSN                                     0x1
#define _IOC_IOCB1_POSITION                                 0x1
#define _IOC_IOCB1_SIZE                                     0x1
#define _IOC_IOCB1_LENGTH                                   0x1
#define _IOC_IOCB1_MASK                                     0x2
#define _IOC_IOCB2_POSN                                     0x2
#define _IOC_IOCB2_POSITION                                 0x2
#define _IOC_IOCB2_SIZE                                     0x1
#define _IOC_IOCB2_LENGTH                                   0x1
#define _IOC_IOCB2_MASK                                     0x4
#define _IOC_IOCB3_POSN                                     0x3
#define _IOC_IOCB3_POSITION                                 0x3
#define _IOC_IOCB3_SIZE                                     0x1
#define _IOC_IOCB3_LENGTH                                   0x1
#define _IOC_IOCB3_MASK                                     0x8
#define _IOC_IOCB4_POSN                                     0x4
#define _IOC_IOCB4_POSITION                                 0x4
#define _IOC_IOCB4_SIZE                                     0x1
#define _IOC_IOCB4_LENGTH                                   0x1
#define _IOC_IOCB4_MASK                                     0x10
#define _IOC_IOCB5_POSN                                     0x5
#define _IOC_IOCB5_POSITION                                 0x5
#define _IOC_IOCB5_SIZE                                     0x1
#define _IOC_IOCB5_LENGTH                                   0x1
#define _IOC_IOCB5_MASK                                     0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned IOC0                   :1;
        unsigned IOC1                   :1;
        unsigned IOC2                   :1;
        unsigned IOC3                   :1;
        unsigned IOC4                   :1;
        unsigned IOC5                   :1;
    };
    struct {
        unsigned IOCB0                  :1;
        unsigned IOCB1                  :1;
        unsigned IOCB2                  :1;
        unsigned IOCB3                  :1;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0x096);
// bitfield macros
#define _IOCB_IOC0_POSN                                     0x0
#define _IOCB_IOC0_POSITION                                 0x0
#define _IOCB_IOC0_SIZE                                     0x1
#define _IOCB_IOC0_LENGTH                                   0x1
#define _IOCB_IOC0_MASK                                     0x1
#define _IOCB_IOC1_POSN                                     0x1
#define _IOCB_IOC1_POSITION                                 0x1
#define _IOCB_IOC1_SIZE                                     0x1
#define _IOCB_IOC1_LENGTH                                   0x1
#define _IOCB_IOC1_MASK                                     0x2
#define _IOCB_IOC2_POSN                                     0x2
#define _IOCB_IOC2_POSITION                                 0x2
#define _IOCB_IOC2_SIZE                                     0x1
#define _IOCB_IOC2_LENGTH                                   0x1
#define _IOCB_IOC2_MASK                                     0x4
#define _IOCB_IOC3_POSN                                     0x3
#define _IOCB_IOC3_POSITION                                 0x3
#define _IOCB_IOC3_SIZE                                     0x1
#define _IOCB_IOC3_LENGTH                                   0x1
#define _IOCB_IOC3_MASK                                     0x8
#define _IOCB_IOC4_POSN                                     0x4
#define _IOCB_IOC4_POSITION                                 0x4
#define _IOCB_IOC4_SIZE                                     0x1
#define _IOCB_IOC4_LENGTH                                   0x1
#define _IOCB_IOC4_MASK                                     0x10
#define _IOCB_IOC5_POSN                                     0x5
#define _IOCB_IOC5_POSITION                                 0x5
#define _IOCB_IOC5_SIZE                                     0x1
#define _IOCB_IOC5_LENGTH                                   0x1
#define _IOCB_IOC5_MASK                                     0x20
#define _IOCB_IOCB0_POSN                                    0x0
#define _IOCB_IOCB0_POSITION                                0x0
#define _IOCB_IOCB0_SIZE                                    0x1
#define _IOCB_IOCB0_LENGTH                                  0x1
#define _IOCB_IOCB0_MASK                                    0x1
#define _IOCB_IOCB1_POSN                                    0x1
#define _IOCB_IOCB1_POSITION                                0x1
#define _IOCB_IOCB1_SIZE                                    0x1
#define _IOCB_IOCB1_LENGTH                                  0x1
#define _IOCB_IOCB1_MASK                                    0x2
#define _IOCB_IOCB2_POSN                                    0x2
#define _IOCB_IOCB2_POSITION                                0x2
#define _IOCB_IOCB2_SIZE                                    0x1
#define _IOCB_IOCB2_LENGTH                                  0x1
#define _IOCB_IOCB2_MASK                                    0x4
#define _IOCB_IOCB3_POSN                                    0x3
#define _IOCB_IOCB3_POSITION                                0x3
#define _IOCB_IOCB3_SIZE                                    0x1
#define _IOCB_IOCB3_LENGTH                                  0x1
#define _IOCB_IOCB3_MASK                                    0x8
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x099);
#ifndef _LIB_BUILD
asm("VRCON equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned                        :1;
        unsigned VRR                    :1;
        unsigned                        :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
    };
} VRCONbits_t;
